Revit 2026 API

# BuiltInFailuresSlabFailures Class

---

Failures about Slab.

SystemObject Autodesk.Revit.DBBuiltInFailuresSlabFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SlabFailures
```
```vb
Public NotInheritable Class SlabFailures
```
```cpp
public ref class SlabFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SlabFailures = class end
```

The BuiltInFailuresSlabFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CantileverValueTooBig | Cantilever value is too big. |

#### Reference

Autodesk.Revit.DB Namespace